export const categories: {
  value: string;
  label: string;
  color: string;
  description: string;
}[] = [
  {
    value: "evil",
    label: "😈 Злой",
    color: "bg-red-600 hover:bg-red-700",
    description: "Резкий и гневный смех, выражающий раздражение или фрустрацию. Может сопровождаться коварными комментариями."
  },
  {
    value: "rich",
    label: "💰 Богатый",
    color: "bg-yellow-500 hover:bg-yellow-600",
    description: "Изысканный, уверенный смех, демонстрирующий статус, силу и решимость."
  },
  {
    value: "stealth",
    label: "🥷 Ниндзя",
    color: "bg-gray-900 hover:bg-gray-950",
    description: "Тихий и скрытный смех, который редко раскрывается полностью, используется в неожиданных моментах."
  },
  {
    value: "non_human",
    label: "🤖 Робот",
    color: "bg-blue-500 hover:bg-blue-600",
    description: "Механический и экзотический смех, отличающийся от земных форм, иногда с электронными искажениями."
  },
  {
    value: "magical",
    label: "🧚‍♀️ Фея",
    color: "bg-pink-500 hover:bg-pink-600",
    description: "Тёплый, добродушный и волшебный смех, ассоциирующийся с радостью и праздниками."
  },
  {
    value: "powerful_frightening",
    label: "🐉 Дракон",
    color: "bg-green-500 hover:bg-green-600",
    description: "Громкий и мощный смех, демонстрирующий силу и величие, иногда вызывающий страх."
  },
  {
    value: "friendly",
    label: "🧝‍♂️ Гном",
    color: "bg-green-500 hover:bg-green-600",
    description: "Весёлый и добродушный смех, характерный для дружелюбных персонажей."
  },
  {
    value: "witch",
    label: "🧙‍♀️ Ведьма",
    color: "bg-purple-500 hover:bg-purple-600",
    description: "Злобный и насмешливый смех, часто сопровождающий хитрые планы или саркастические комментарии."
  },
  {
    value: "clown",
    label: "🤡 Клоун",
    color: "bg-yellow-500 hover:bg-yellow-600",
    description: "Весёлый и заразительный смех, вызывающий радость и улыбки у окружающих."
  },
  {
    value: "pirate",
    label: "🏴‍☠️ Пират",
    color: "bg-gray-800 hover:bg-gray-900",
    description: "Грубый и хриплый смех с нотками дерзости и уверенности."
  },
  {
    value: "ghost",
    label: "👻 Призрак",
    color: "bg-gray-300 hover:bg-gray-400",
    description: "Зловещий и эхо-звучащий смех, вызывающий дрожь и таинственность."
  },
  {
    value: "child",
    label: "👶 Ребёнок",
    color: "bg-yellow-300 hover:bg-yellow-400",
    description: "Милый и нежный смех, вызывающий умиление и улыбки, характерный для детей."
  },
  {
    value: "poor",
    label: "🥺 Бедный",
    color: "bg-gray-400 hover:bg-gray-500",
    description: "Скромный и искренний смех, ну или смех бомжа отражающий жизненные трудности с позитивом."
  },
  {
    value: "chicken",
    label: "🐔 Курица",
    color: "bg-yellow-300 hover:bg-yellow-400",
    description: "Неряшливый и смешной смех, напоминающий кукареканье или куриный звук."
  },
  {
    value: "alcohol",
    label: "🍻 Алко",
    color: "bg-orange-500 hover:bg-orange-600",
    description: "Расслабленный и иногда неустойчивый смех, возникающий под воздействием алкоголя."
  },
  {
    value: "unsorted",
    label: "🍻 Пропуск",
    color: "bg-orange-500 hover:bg-orange-600",
    description: "Расслабленный и иногда неустойчивый смех, возникающий под воздействием алкоголя."
  },
];